---
kind: method
id: M:Autodesk.Revit.DB.ColorFillLegend.GetColumnWidths
source: html/bea0b37a-991b-8ddc-28d7-0bacf0f4181a.htm
---
# Autodesk.Revit.DB.ColorFillLegend.GetColumnWidths Method

Returns array of column widths in the legend.

## Syntax (C#)
```csharp
public IList<double> GetColumnWidths()
```